-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: metro
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `platform1`
--

DROP TABLE IF EXISTS `platform1`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `platform1` (
  `Seq` int NOT NULL AUTO_INCREMENT,
  `LineNum` text COLLATE utf8mb3_unicode_ci,
  `StationCode` int DEFAULT NULL,
  `StationNameplus` varchar(20) COLLATE utf8mb3_unicode_ci DEFAULT NULL,
  `AboveUnder` varchar(10) COLLATE utf8mb3_unicode_ci DEFAULT NULL,
  `Floor` varchar(10) COLLATE utf8mb3_unicode_ci DEFAULT NULL,
  `Connection` int DEFAULT NULL,
  PRIMARY KEY (`Seq`)
) ENGINE=InnoDB AUTO_INCREMENT=128 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `platform1`
--

LOCK TABLES `platform1` WRITE;
/*!40000 ALTER TABLE `platform1` DISABLE KEYS */;
INSERT INTO `platform1` VALUES (1,'1호선',105,'괴정','지하','2',1),(2,'1호선',124,'교대','지하','2',1),(3,'1호선',130,'구서','지상','2',0),(4,'1호선',132,'남산(부산외국대학교)','지하','2',0),(5,'1호선',111,'남포','지하','2',0),(6,'1호선',97,'낫개','지하','3',0),(7,'1호선',134,'노포(종합버스터미널)','지상','2',0),(8,'1호선',96,'다대포항','지하','2',0),(9,'1호선',95,'다대포해수욕장','지하','2',1),(10,'1호선',103,'당리(사하구청)','지하','2',0),(11,'1호선',106,'대티(동주대학)','지하','5',1),(12,'1호선',108,'동대신','지하','2',0),(13,'1호선',125,'동래','지상','2',1),(14,'1호선',100,'동매','지하','2',0),(15,'1호선',131,'두실','지하','2',0),(16,'1호선',126,'명륜','지상','2',0),(17,'1호선',118,'범내골','지하','2',1),(18,'1호선',133,'범어사','지하','3',0),(19,'1호선',117,'범일','지하','2',0),(20,'1호선',128,'부산대','지상','2',0),(21,'1호선',113,'부산','지하','2',0),(22,'1호선',115,'부산진','지하','2',1),(23,'1호선',120,'부전(부산시민공원·송상현광장)','지하','2',0),(24,'1호선',104,'사하','지하','2',0),(25,'1호선',107,'서대신','지하','4',1),(26,'1호선',119,'서면','지하','2',1),(27,'1호선',122,'시청(연제)','지하','2',1),(28,'1호선',98,'신장림','지하','2',0),(29,'1호선',101,'신평','지하','1',0),(30,'1호선',121,'양정','지하','2',1),(31,'1호선',123,'연산','지하','2',1),(32,'1호선',127,'온천장','지상','2',0),(33,'1호선',110,'자갈치','지하','2',0),(34,'1호선',99,'장림','지하','2',0),(35,'1호선',129,'장전(부산가톨릭대학교)','지상','2',0),(36,'1호선',116,'좌천','지하','2',0),(37,'1호선',112,'중앙','지하','2',1),(38,'1호선',114,'초량','지하','2',0),(39,'1호선',109,'토성','지하','2',0),(40,'1호선',102,'하단(부산본병원)','지하','2',0),(41,'2호선',221,'가야','지하','3',1),(42,'2호선',226,'감전(사상구청)','지하','2',0),(43,'2호선',223,'개금','지하','3',1),(44,'2호선',212,'경성대·부경대(동명대학교)','지하','3',1),(45,'2호선',209,'광안','지하','3',1),(46,'2호선',231,'구남','지하','3',0),(47,'2호선',232,'구명','지하','3',0),(48,'2호선',217,'국제금융센터·부산은행','지하','2',1),(49,'2호선',238,'금곡','지상','2',0),(50,'2호선',210,'금련산','지하','4',1),(51,'2호선',242,'남양산(범어)','지상','3',1),(52,'2호선',211,'남천(KBS·수영구청)','지하','3',1),(53,'2호선',224,'냉정','지하','2',0),(54,'2호선',213,'대연(고려병원)','지하','3',1),(55,'2호선',233,'덕천(부산과기대)','지하','2',1),(56,'2호선',228,'덕포','지하','2',0),(57,'2호선',204,'동백','지하','2',0),(58,'2호선',237,'동원','지상','1',1),(59,'2호선',222,'동의대','지하','4',1),(60,'2호선',229,'모덕','지하','2',0),(61,'2호선',230,'모라','지하','2',0),(62,'2호선',214,'못골(남구청)','지하','3',1),(63,'2호선',216,'문현','지하','3',1),(64,'2호선',207,'민락','지하','3',0),(65,'2호선',205,'벡스코(시립미술관)','지하','2',0),(66,'2호선',241,'부산대양산캠퍼스','지상','1',1),(67,'2호선',220,'부암(온종합병원)','지하','3',1),(68,'2호선',227,'사상(서부터미널)','지하','2',0),(69,'2호선',219,'서면','지하','3',1),(70,'2호선',206,'센텀시티(BEXCO·신세계)','지하','2',0),(71,'2호선',208,'수영','지하','3',1),(72,'2호선',234,'수정(방송통신대)','지하','2',0),(73,'2호선',243,'양산(시청·동원과학기술대학교)','지상','3',1),(74,'2호선',236,'율리','지하','2',0),(75,'2호선',201,'장산(해운대백병원)','지하','2',1),(76,'2호선',218,'전포','지하','3',1),(77,'2호선',225,'주례','지하','2',0),(78,'2호선',202,'중동','지하','2',0),(79,'2호선',240,'증산','지상','2',0),(80,'2호선',215,'지게골','지하','4',1),(81,'2호선',203,'해운대','지하','2',1),(82,'2호선',239,'호포','지상','5',1),(83,'2호선',235,'화명','지하','2',0),(84,'3호선',315,'강서구청','지상','5',0),(85,'3호선',306,'거제(법원·검찰청)','지하','2',0),(86,'3호선',314,'구포','지상','2',0),(87,'3호선',311,'남산정(부산폴리텍대학)','지하','2',0),(88,'3호선',317,'대저','지상','3',1),(89,'3호선',313,'덕천(부산과기대)','지하','3',1),(90,'3호선',310,'만덕','지하','9',1),(91,'3호선',302,'망미(병무청)','지하','6',1),(92,'3호선',304,'물만골','지하','5',1),(93,'3호선',309,'미남','지하','3',1),(94,'3호선',303,'배산','지하','8',1),(95,'3호선',308,'사직','지하','2',0),(96,'3호선',301,'수영','지하','4',1),(97,'3호선',312,'숙등(부민병원)','지하','3',0),(98,'3호선',305,'연산','지하','4',1),(99,'3호선',307,'종합운동장','지하','3',1),(100,'3호선',316,'체육공원','지상','4',1),(101,'4호선',413,'고촌','지상','2',1),(102,'4호선',408,'금사','지하','3',1),(103,'4호선',404,'낙민','지하','3',1),(104,'4호선',402,'동래','지하','4',1),(105,'4호선',406,'명장','지하','3',1),(106,'4호선',401,'미남','지하','3',1),(107,'4호선',409,'반여농산물시장','지상','1',1),(108,'4호선',407,'서동','지하','3',1),(109,'4호선',410,'석대','지상','2',1),(110,'4호선',403,'수안','지하','3',1),(111,'4호선',414,'안평(고촌주택단지)','지상','2',1),(112,'4호선',411,'영산대(아랫반송)','지상','2',1),(113,'4호선',412,'윗반송','지상','2',1),(114,'4호선',405,'충렬사(안락)','지하','3',1);
/*!40000 ALTER TABLE `platform1` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-07-27 17:11:09
